[
{"id": "http://arxiv.org/abs/2512.10901v1", "title": "FLRW embeddings in $\\mathbb{R}^{n+2}$, differential geometry and conformal photon propagator", "authors": ["E. Huguet", "J. Queva", "J. Renaud"], "published": "2025-12-11T18:30:31Z", "summary": "This paper introduces differential-geometric methods to study $n$-dimensional locally conformally flat spaces as submanifolds in $\\mathbb{R}^{n+2}$. We derive explicit formulas relating intrinsic and ambient differential-geometric objects, including curvature tensors, the codifferential and laplacian operators. We apply this approach to Friedmann-Lemaître-Robertson-Walker (FLRW) spaces using newfound embedding formulas, obtaining new and simplified expressions for the photon propagator in four dimensions."},
{"id": "http://arxiv.org/abs/2512.10845v1", "title": "Uniform RC-positivity of direct image bundles", "authors": ["Kuang-Ru Wu"], "published": "2025-12-11T17:32:01Z", "summary": "The concept of RC-positivity and uniform RC-positivity is introduced by Xiaokui Yang to solve a conjecture of Yau on projectivity and rational connectedness of a compact Kähler manifold with positive holomorphic sectional curvature. Some main theorems in Yang's proof hold under a weaker condition called weak RC-positivity. It is therefore natural to ask if (uniform) weak RC-positivity implies (uniform) RC-positivity. Another motivation for studying this problem is to understand the relation between rational connectedness of $X$ and (uniform) RC-positivity of the holomorphic tangent bundle $TX$.   In this paper, we obtain results in this direction. In particular, we show that if a vector bundle $E$ is uniformly weakly RC-positive, then $S^kE\\otimes \\det E$ is uniformly RC-positive for any $k\\geq 0$, and $S^kE$ is uniformly RC-positive for $k$ large. We also discuss an approach that might lead to a solution to the question of whether weak RC-positivity of $E$ implies RC-positivity of $E$."},
{"id": "http://arxiv.org/abs/2512.10699v1", "title": "A simplified proof of a cosmological singularity theorem", "authors": ["Gregory J. Galloway", "Eric Ling"], "published": "2025-12-11T14:40:59Z", "summary": "In a previous paper [9], we proved the following singularity theorem applicable to cosmological models with a positive cosmological constant: if a four-dimensional spacetime satisfying the null energy condition contains a compact Cauchy surface which is expanding in all directions, then the spacetime is past null geodesically incomplete unless the Cauchy surface is topologically a spherical space. The proof in [9] made use of the positive resolution of the surface subgroup conjecture [15]. In this note, we demonstrate how the less-broadly-known positive resolution of the virtual positive first Betti number conjecture [1] provides a more streamlined and unified approach to the proof. We illustrate the theorem with some examples and analyze its rigidity under null geodesic completeness."},
{"id": "http://arxiv.org/abs/2512.10482v1", "title": "Components of generalised complex structures on transitive Courant algebroids", "authors": ["Vicente Cortés", "Liana David"], "published": "2025-12-11T09:59:22Z", "summary": "Generalised almost complex structures $\\mathcal J$ on transitive Courant algebroids $E$ are studied in terms of their components with respect to a splitting $E\\cong TM \\oplus T^*M \\oplus \\mathcal G$, where $M$ denotes the base of $E$ and $\\mathcal G$ its bundle of quadratic Lie algebras. Necessary and sufficient integrability equations for $\\mathcal J$ are established in this formalism. As an application, it is shown that the integrability of $\\mathcal J$ implies that one of the components defines a Poisson structure on $M$. Then the structure (normal form) of generalised complex structures for which the Poisson structure is non-degenerate is determined. It is shown that it is fully encoded in a pair $(ω, ρ)$ consisting of a symplectic structure $ω$ on $M$ and a representation $ρ: π_1(M) \\to \\mathrm{Aut}(\\mathfrak g, \\langle \\cdot ,\\cdot \\rangle_{\\mathfrak{g}}, J_{\\mathfrak{g}})$ by automorphism of a quadratic Lie algebra $(\\mathfrak g, \\langle \\cdot ,\\cdot \\rangle_{\\mathfrak{g}})$ commuting with an integrable (in the sense of Lie algebras) skew-symmetric complex structure $J_{\\mathfrak{g}}$. Examples of such representations and obstructions for the existence of non-degenerate generalised complex structures are discussed. Finally, a construction of generalised complex structures on transitive Courant algebroids over complex manifolds for which the Poisson structure degenerates along a complex analytic hypersurface is presented."},
{"id": "http://arxiv.org/abs/2512.10466v1", "title": "Geometric quantization on big line bundles", "authors": ["Siarhei Finski"], "published": "2025-12-11T09:42:39Z", "summary": "We extend several geometric quantization results to the setting of big line bundles. More precisely, we prove the asymptotic isometry property for the map that associates to a metric on a big line bundle the corresponding sup-norms on the spaces of holomorphic sections of its tensor powers. Building on this, we show that submultiplicative norms on section rings of big line bundles are asymptotically equivalent to sup-norms. As an application, we show that any bounded submultiplicative filtration on the section ring of a big line bundle naturally gives rise to a Mabuchi geodesic ray, and the speed of this ray encodes the statistical invariants of the filtration."},
{"id": "http://arxiv.org/abs/2512.10423v1", "title": "Rotational Weingarten surfaces in Lorentz-Minkowski space", "authors": ["Paula Carretero", "Ildefonso Castro", "Ildefonso Castro-Infantes"], "published": "2025-12-11T08:35:59Z", "summary": "We propose a new approach to the study of rotational surfaces in Lorentz-Minkowski space based on the notion of the geometric linear momentum of the generatrix curves with respect to the axes of revolution. This technique allows us to reduce any Weingarten condition on the surface to a first-order ordinary differential equation for the momentum as a function of the distance to the corresponding axis, providing a unified framework that encompasses the three causal types of rotation axes. As a direct application, we classify important families of rotational Weingarten surfaces in this setting, including some linear and quadratic cases. Furthermore, we introduce the non-degenerate quadric surfaces of revolution in Lorentz-Minkowski space and characterize them in terms of a specific cubic Weingarten relation."},
{"id": "http://arxiv.org/abs/2512.10200v1", "title": "Symmetries of extremal horizons", "authors": ["Alex Colling"], "published": "2025-12-11T01:39:35Z", "summary": "We prove an intrinsic analogue of Hawking's rigidity theorem for extremal horizons in arbitrary dimensions: any compact cross-section of a rotating extremal horizon in a spacetime satisfying the null energy condition must admit a Killing vector field. If the dominant energy condition is satisfied for null vectors, it follows that an extension of the near-horizon geometry admits an enhanced isometry group containing $SO(2,1)$ or the 2D Poincaré group $\\mathbb{R}^2 \\rtimes SO(1,1)$. In the latter case, the associated Aretakis instability for a massless scalar field is shifted by one order in the derivatives of the field transverse to the horizon. We consider a broad class of examples including Einstein-Maxwell(-Chern-Simons) theory and Yang-Mills theory coupled to charged matter. In these examples we show that the symmetries are inherited by the matter fields."},
{"id": "http://arxiv.org/abs/2512.09653v1", "title": "Remarks on potential functions of noncompact quasi-Einstein manifolds", "authors": ["Jaciane Gonçalves"], "published": "2025-12-10T13:48:41Z", "summary": "In this article, we study the set of potential functions on noncompact quasi-Einstein manifolds. We show that the space of all positive potential functions on a three-dimensional noncompact quasi-Einstein manifold has dimension at most two, and that equality holds if and only if the manifold is isometric to a product $B\\times\\mathbb{R}$, where $B$ is a $λ$-Einstein surface or one of the examples obtained by L. Berard Bergery and described in Besse's book. Moreover, we prove that any asymptotically flat $n$-dimensional quasi-Einstein manifold with $λ=0$ is necessarily Ricci-flat."},
{"id": "http://arxiv.org/abs/2512.09605v1", "title": "Extensions and Applications of Stein-Weiss Operators to Traceless Symmetric Tensor", "authors": ["Sergey Stepanov", "Irina Tsyganok"], "published": "2025-12-10T12:52:24Z", "summary": "First-order differential operators arising from the representation-theoretic decomposition of the covariant derivative play a central role in Riemannian geometry. In this paper, we study Stein-Weiss $O(n)$-gradients acting on covariant symmetric trace-free tensors of arbitrary rank $p \\ge 2$. By analyzing the decomposition of $T^*M \\otimes S_0^p(M)$ into its $O(n)$-irreducible components, we explicitly describe the corresponding generalized gradients and compute Weitzenbock formulas for their adjoint compositions. These results extend Bouguignon four-dimensional formulas for $p = 2$ and generalize previous work of other authors to higher-rank symmetric tensors. The formulas obtained provide a unified framework for understanding second-order Stein-Weiss operators and yield tools applicable to deformation complexes, curvature estimates, and stability problems in geometric analysis. The article continues the authors' earlier investigations of Stein-Weiss operators on natural tensor bundles."},
{"id": "http://arxiv.org/abs/2512.09569v1", "title": "Equiaffine immersions and pseudo-Riemannian space forms", "authors": ["Nicholas Rungi"], "published": "2025-12-10T12:02:08Z", "summary": "We introduce an explicit construction that produces immersions into the pseudosphere $\\mathbb{S}^{n,n+1}$ and the pseudohyperbolic space $\\mathbb{H}^{n+1,n}$ starting from equiaffine immersions in $\\mathbb{R}^{n+1}$, and conversely. We describe how these immersions interact with a para-Sasaki metric defined on $\\mathbb{H}^{n+1,n}$ via a principal $\\mathbb{R}$-bundle structure over a para-Kähler manifold. In the case where the immersion in $\\mathbb{R}^{n+1}$ is an $n$-dimensional hyperbolic affine sphere, we obtain spacelike maximal immersions in $\\mathbb{H}^{n+1,n}$ that satisfy a transversality condition with respect to the principal $\\mathbb{R}$-bundle structure. As a first application, we show that, given a certain boundary set $Λ_Ω\\subset \\partial_\\infty \\mathbb{H}^{n+1,n}$, associated with a properly convex subset $Ω\\subset \\mathbb{RP}^n$ and homeomorphic to an $(n-1)$-sphere, there exists an $n$-dimensional maximal spacelike submanifold in $\\mathbb{H}^{n+1,n}$ whose boundary is precisely $Λ_Ω$. As a second application, we show that the Blaschke lift of the hyperbolic affine sphere, introduced by Labourie for $n=2$, into the symmetric space of $\\mathrm{SL}(n+1,\\mathbb{R})$ is a harmonic map."},
{"id": "http://arxiv.org/abs/2512.09532v1", "title": "Bochner's technique in Einstein's non-symmetric geometry", "authors": ["Vladimir Rovenski"], "published": "2025-12-10T11:13:41Z", "summary": "A. Einstein considered a manifold with a non-symmetric (0,2)-tensor $G$ and a linear connection $\\nabla=(Γ^k_{ij})$ satisfying the condition $\\dfrac{\\partial G_{ij}}{\\partial x^k} = Γ^p_{ik}G_{pj} +Γ^p_{kj}G_{ip}$. Guided by the construction of an almost Lie algebroid (on a vector bundle), we define the following concepts of Bochner's technique for the Einstein's non-symmetric geometry: the $\\nabla^{f}$-connection, Bochner and Hodge $f$-Laplacians on tensors, the $f$-curvature operator and the Weitzenböck type curvature operator of Einstein's connection. We prove Weitzenböck type decomposition formula and obtain vanishing results about the null space of the Bochner and Hodge $f$-Laplacians."},
{"id": "http://arxiv.org/abs/2512.09490v1", "title": "Isoperimetric Regions in Anisotropically Scaled Product Manifolds", "authors": ["Efstratios Vernadakis"], "published": "2025-12-10T10:08:03Z", "summary": "Let $M, N$ be compact Riemannian manifolds. Then, for fixed volume fraction, in the product of a sufficiently small homothetic copy of $M$ with $N$, every isoperimetric region is the product of $M$ with an isoperimetric region in $N$, provided the boundaries of the isoperimetric regions in $N$ are smooth."},
{"id": "http://arxiv.org/abs/2512.09376v1", "title": "Rates and architectures for learning geometrically non-trivial operators", "authors": ["T. Mitchell Roddenberry", "Leo Tzou", "Ivan Dokmanić", "Maarten V. de Hoop", "Richard G. Baraniuk"], "published": "2025-12-10T07:15:07Z", "summary": "Deep learning methods have proven capable of recovering operators between high-dimensional spaces, such as solution maps of PDEs and similar objects in mathematical physics, from very few training samples. This phenomenon of data-efficiency has been proven for certain classes of elliptic operators with simple geometry, i.e., operators that do not change the domain of the function or propagate singularities. However, scientific machine learning is commonly used for problems that do involve the propagation of singularities in a priori unknown ways, such as waves, advection, and fluid dynamics. In light of this, we expand the learning theory to include double fibration transforms--geometric integral operators that include generalized Radon and geodesic ray transforms. We prove that this class of operators does not suffer from the curse of dimensionality: the error decays superalgebraically, that is, faster than any fixed power of the reciprocal of the number of training samples. Furthermore, we investigate architectures that explicitly encode the geometry of these transforms, demonstrating that an architecture reminiscent of cross-attention based on levelset methods yields a parameterization that is universal, stable, and learns double fibration transforms from very few training examples. Our results contribute to a rapidly-growing line of theoretical work on learning operators for scientific machine learning."},
{"id": "http://arxiv.org/abs/2512.09253v1", "title": "Massless Majorana spinors in the Kerr spacetime", "authors": ["Tianyuan Cai", "Xiao Zhang"], "published": "2025-12-10T02:15:01Z", "summary": "In this paper, we show that massive Majorana spinors \\eqref{1.2} do not exist if they are $t$-dependent or $φ$-dependent in Kerr, or Kerr-(A)dS spacetimes. For massless Majorana spinors in the non-extreme Kerr spacetime, the Dirac equation can be separated into radial and angular equations, parameterized by two complex constants $ε_1$, $ε_2$. If at least one of $ε_1$, $ε_2$ is zero, massless Majorana spinors can be solved explicitly. If $ε_1$, $ε_2$ are nonzero, we prove the nonexistence of massless time-periodic Majorana spinors in the non-extreme Kerr spacetime which are $L^p$ outside the event horizon for $ 0<p\\le\\frac{6}{|ε_1|+|ε_2| +2}$. We then provide the Hamiltonian formulation for massless Majorana spinors and prove that the self-adjointness of the Hamiltonian leads to the angular momentum $a=0$ and spacetime reduces to the Schwarzschild spacetime, moreover, the massless Majorana spinor must be $φ$-independent. Finally, we show that, in the Schwarzschild spacetime, for initial data with $L^2$ decay at infinity, the probability of the massless Majorana spinors to be in any compact region of space tends to zero as time tends to infinity."},
{"id": "http://arxiv.org/abs/2512.09146v1", "title": "Domination of manifolds by hypersurfaces", "authors": ["Vasilii Rozhdestvenskii"], "published": "2025-12-09T21:49:02Z", "summary": "In this short note we prove that any smooth, closed, oriented manifold can be dominated by a codimension 1 submanifold of the sphere."},
{"id": "http://arxiv.org/abs/2512.09068v1", "title": "Geometric invariants and the Monge-Ampere equation in Kähler geometry", "authors": ["Bin Guo", "Duong H. Phong"], "published": "2025-12-09T19:34:05Z", "summary": "This is a contribution to the special issue of Surveys in Differential Geometry celebrating the 75th birthday of Shing-Tung Yau. The bulk of the paper is devoted to a survey of some new geometric inequalities and estimates for the Monge-Ampere equation, obtained by the authors in the last few years in joint work with F. Tong, J. Song, and J. Sturm. These all depend in an essential way on Yau's solution of the Calabi conjecture, which is itself nearing its own 50th birthday. The opportunity is also taken to survey briefly many current directions in complex geometry, which he more recently pioneered."},
{"id": "http://arxiv.org/abs/2512.08795v1", "title": "Dubrovin duality for open Hurwitz flat F-manifolds", "authors": ["Alessandro Proserpio", "Ian A. B. Strachan"], "published": "2025-12-09T16:44:22Z", "summary": "We prove that the Dubrovin dual of a Hurwitz Frobenius manifold extends naturally to an F-manifold with compatible flat connection on the universal curve, in the sense of the open WDVV equations. A similar result is proven for the Frobenius manifold itself in arXiv:2503.09258 . This equips the universal curve with two F-manifolds with compatible flat structure, and we study their duality. We show that they combine into a bi-flat F-manifold. Conditions on open WDVV solutions imposed in previous work are retrieved in this setting, thus providing them with a geometrical meaning. Finally, explicit examples are computed. For Saito Frobenius manifolds of types $A$ and $D$, the extended prepotentials coincide with open WDVV solutions computed independently, whereas even the existence of the solution in type $E$ had not been previously discussed. On the other hand, new non-homogeneous solutions are constructed by duality."},
{"id": "http://arxiv.org/abs/2512.08776v1", "title": "Brachistochrone-ruled timelike surfaces in Newtonian and relativistic spacetimes", "authors": ["Ferhat Taş"], "published": "2025-12-09T16:30:58Z", "summary": "We introduce and study \\emph{brachistochrone-ruled timelike surfaces} in Newtonian and relativistic spacetimes. Starting from the classical cycloidal brachistochrone in a constant gravitational field, we construct a Newtonian ``brachistochrone-ruled worldsheet'' whose rulings are time-minimizing trajectories between pairs of endpoints. We then generalize this construction to stationary Lorentzian spacetimes by exploiting the reduction of arrival-time functionals to Finsler- or Jacobi-type length functionals on a spatial manifold. In this framework, relativistic brachistochrones arise as geodesics of an associated Finsler structure, and brachistochrone-ruled timelike surfaces are timelike surfaces ruled by these time-minimizing worldlines. We work out explicit examples in Minkowski spacetime and in the Schwarzschild exterior: in the flat case, for a bounded-speed time functional, the brachistochrones are straight timelike lines and a simple family of brachistochrone-ruled surfaces turns out to be totally geodesic; in the Schwarzschild case, we show how coordinate-time minimization at fixed energy reduces to geodesics of a Jacobi metric on the spatial slice, and outline a numerical scheme for constructing brachistochrone-ruled timelike surfaces. Finally, we discuss basic geometric properties of such surfaces and identify natural Jacobi fields along the rulings."},
{"id": "http://arxiv.org/abs/2512.08590v1", "title": "Poisson bivectors on infinite dimensional manifolds", "authors": ["Peter W. Michor", "Praful Rahangdale"], "published": "2025-12-09T13:31:19Z", "summary": "We show that, on a smoothly paracompact convenient manifold $M$ modeled on a convenient space with the bornological approximation property, the dual map of a Poisson bracket factors as a smooth section of the vector bundle $L_{skew}^2(T^*M,\\mathbb R)$."},
{"id": "http://arxiv.org/abs/2512.08552v1", "title": "Mixed Hessian inequalities on Hermitian manifolds and applications", "authors": ["Haoyuan Sun"], "published": "2025-12-09T12:47:46Z", "summary": "Let $(X,ω)$ be a compact Hermitian manifold of complex dimension $n$. In this paper we establish a Kołodziej-Nguyen type weak convergence theorem of complex Hessian operators. Utilizing this result, we prove a general mixed Hessian inequality with respect to a background Hermitian metric, covering both local and global case. As an application, we prove the existence of bounded solutions of complex Hessian equations where the right-hand side measure is well dominated by capacities."},
{"id": "http://arxiv.org/abs/2512.08342v1", "title": "Chern Conjecture on Minimal Willmore Hypersurfaces with Constant Scalar Curvature", "authors": ["Jianquan Ge", "Huixin Tan", "Wenjiao Yan", "Yunheng Zhang"], "published": "2025-12-09T08:12:20Z", "summary": "In this paper, we prove that for an $n$-dimensional closed minimal Willmore hypersurface $M^n$ with constant scalar curvature in the unit sphere $\\mathbb{S}^{n+1}$, the squared norm $S$ of the second fundamental form of $M^n$ satisfies $S\\geqslant n+\\frac{4n+9-\\sqrt{4 n^{2}+60 n+81}}{2}$ if $S>n$. This proves, in the approximate sense, the Chern conjecture about the second gap ($S\\geqslant 2n$ if $S>n$), which will be fully verified under a further inequality condition about the 4-th mean curvature."},
{"id": "http://arxiv.org/abs/2512.08275v1", "title": "On the Bergman metric of a pseudoconvex domain with a strongly pseudoconvex polyhedral boundary point", "authors": ["Xiaojun Huang", "Scott James", "Xiaoshan Li"], "published": "2025-12-09T06:08:50Z", "summary": "Let $D\\subset\\mathbb{C}^n$ with $n>1$ be a pseudoconvex domain, possibly unbounded, that contains a non-smooth strongly pseudoconvex polyhedral boundary point. We show that the Bergman metric of $D$ is not Einstein."},
{"id": "http://arxiv.org/abs/2512.07812v1", "title": "Caustics in the spherically symmetric Einstein-dust system", "authors": ["David Bick"], "published": "2025-12-08T18:46:49Z", "summary": "Caustics-envelopes formed by the trajectories of fluid particles-arise in proposed dynamical extensions for shell-crossing singularities occurring in the Einstein-dust system. In this study, a local existence result is established, describing the dynamics in a neighbourhood of such caustics. Specifically, we obtain spherically symmetric spacetimes $(M,g_{μν})$ containing a caustic $\\mathcal{C}$, which, in the quotient $M/SO(3)$, is a timelike curve forming a singular boundary between a 2-dust region and a vacuum region. The spacetimes are constructed from solutions to a PDE problem posed with a spacelike direction of evolution. Curvature invariants and energy densities diverge as the caustic is approached. Consequently the metric has limited regularity $g\\in C^{1,1/2}$ and is shown to satisfy Einstein's equation weakly. On the complement of the caustic, the metric is smooth and satisfies Einstein's equation classically. A (degenerate) coordinate system is identified in which the dynamical variables are smooth with extension to the caustic. Finally, a novel family of static, spherically symmetric spacetimes is identified, complementing the local construction above. Each spacetime contains an eternal annular 2-dust region bounded by a pair of caustics."},
{"id": "http://arxiv.org/abs/2512.07734v1", "title": "Index and nullity of minimal surface doublings, I", "authors": ["Nikolaos Kapouleas", "Jiahua Zou"], "published": "2025-12-08T17:21:56Z", "summary": "We prove that for any large enough $m \\in\\mathbb{N}$, the genus $γ=m+1$ equator-poles minimal surface doubling of the equatorial two-sphere $Σ^0 = \\mathbb{S}^2_{\\mathrm{eq}}$ in the round three-sphere $\\mathbb{S}^3$, which has two catenoidal bridges at the poles and $m$ bridges equidistributed along the equatorial circle $\\mathscr{C}$ of $Σ^0 $ and was discovered in earlier work of Kapouleas, has index $2γ+5=2m+7$ and nullity $6$, and so it has no exceptional Jacobi fields and is $C^1$-isolated."},
{"id": "http://arxiv.org/abs/2512.07707v1", "title": "The topology of local quaternionic toric actions", "authors": ["Panagiotis Batakidis", "Ioannis Gkeneralis"], "published": "2025-12-08T16:53:01Z", "summary": "In this paper we examine the topology of manifolds equipped with a local quaternionic toric action modeled on the regular representation of the quaternionic torus $Q^n=(S^3)^n$. Building on our previous work, where the toric, differential and tetraplectic foundations were established, we show that the global topology of such manifolds is determined by the orbit space and its characteristic data. We construct Leray--Serre and Atiyah--Hirzebruch spectral sequences for the orbit projection, yielding explicit descriptions of the cohomology and $K$-theory of manifolds equipped with local quaternionic toric actions. In dimension four, we develop a quaternionic analogue of the Meyer signature formula and we briefly outline an $L$-theoretic interpretation of the resulting signature invariants. These results extend the methods of the classical (complex) toric topology to the quaternionic setting."},
{"id": "http://arxiv.org/abs/2512.07660v2", "title": "Entropy-Smooth Structures on Topological Manifolds", "authors": ["Amandip Sangha"], "published": "2025-12-08T15:55:59Z", "summary": "We introduce an information-theoretic framework for smooth structures on topological manifolds, replacing coordinate charts with small-scale entropy data of local probability probes. A concise set of axioms identifies admissible coordinate functions and reconstructs a smooth atlas directly from the quadratic entropy response. We prove that this entropy-smooth structure is equivalent to the classical smooth structure, stable under perturbations, and compatible with products, submanifolds, immersions, and diffeomorphisms. This establishes smoothness as an information-theoretic phenomenon and forms the foundational layer of a broader program linking entropy, diffusion, and differential geometry."},
{"id": "http://arxiv.org/abs/2512.07621v1", "title": "Approximating sub-riemannian structures by Riemannian metrics and spectral convergence", "authors": ["Leo Harakeh", "Luc Hillairet"], "published": "2025-12-08T15:07:45Z", "summary": "We construct an approximating sequence of Riemannian metrics tailored to a given sub-Riemannian structure. We prove that the sequence of associated Riemannian volumes converge to Popp's volume and we then proceed to study the spectral convergence of the associated Laplace operators."},
{"id": "http://arxiv.org/abs/2512.07553v1", "title": "Universal Hitchin moduli spaces", "authors": ["Luis Álvarez-Cónsul", "Mario Garcia-Fernandez", "Oscar García-Prada", "Samuel Trautwein"], "published": "2025-12-08T13:37:22Z", "summary": "We study metric aspects of the universal moduli space of solutions to Hitchin's equations as the complex structure $J$ varies over the Teichmüller space $\\mathcal{T}$ of a closed surface $Σ$. Our approach is gauge theoretical and builds on the theory of Kähler fibrations and the moment map interpretation of constant scalar curvature Kähler metrics. Our first main result establishes that, over the moduli space of cscK metrics, the universal moduli space of solutions to Hitchin's equations carries a natural complex structure together with a family of pseudo-Kähler metrics forming a Kähler fibration with a Kähler Ehresmann connection.   We then investigate a second universal moduli space, constructed from the space of flat $G$-connections over $\\mathcal{T}$, which admits a nontrivial $J$-dependent Kähler fibration structure discovered by Hitchin. Using symplectic reduction, we build universal moduli spaces of solutions to the harmonicity equations depending on a coupling constant $α$, obtaining natural complex and pseudo-Kähler structures and an explicit Kähler potential. The main novelty here is that this moduli space is defined by a system coupling the scalar curvature with a cubic term in the Higgs field. Finally, we propose a conjectural relationship between the two resulting families of moduli spaces in the weak-coupling limit $α\\to 0$, inspired by the twistor geometry of Hitchin's hyperkähler moduli space."},
{"id": "http://arxiv.org/abs/2512.07529v1", "title": "Varietà di Jacobi parziali", "authors": ["Patrick Cabau"], "published": "2025-12-08T13:02:38Z", "summary": "The notion of partial Jacobi manifold is introduced in the convenient ($c^\\infty$-complete) framework of Frölicher, Kriegl, and Michor. Explicit examples are provided in both finite and infinite dimensions, and the characteristic distribution associated with this structure is analysed. Several research directions that would merit further study are indicated."},
{"id": "http://arxiv.org/abs/2512.07460v1", "title": "On local holomorphic maps between Hermitian manifolds preserving $(p,p)$-forms", "authors": ["Shan Tai Chan"], "published": "2025-12-08T11:37:01Z", "summary": "In this article, we generalize some results in Chan-Yuan (2025) to local holomorphic maps between Hermitian manifolds preserving $(p,p)$-forms. In particular, we obtain further rigidity theorems and non-existence theorems for such maps."},
{"id": "http://arxiv.org/abs/2512.07418v1", "title": "A weighted Reilly type integral formula for differential forms and its applications", "authors": ["Cao Liyi", "Huang Guangyue", "Song Hongru"], "published": "2025-12-08T10:52:40Z", "summary": "In this paper, we derive a weighted Reilly type integral formula for differential forms on a compact smooth metric measure space with boundary. As applications, a lower bound of the spectrum for the weighted Hodge Laplacian acting on differential forms on the boundary, and some special properties for p-th absolute cohomology space with respect to the lowest p-curvatures of the boundary have been obtained, respectively. Furthermore, we obtain a lower bound for the first positive eigenvalue of the Steklov eigenvalue problem on differential forms which is related to the lowest principal curvature of the boundary, and a comparison result between the eigenvalues of the Steklov eigenvalue problem and the Hodge Laplacian on the boundary. On the other hand, for closed submanifolds of weighted Euclidean space, we derive universal inequalities for the sum of eigenvalues with respect to the weighted Hodge Laplacian, which can be seen as a generalization of Levitin-Parnovski inequality."},
{"id": "http://arxiv.org/abs/2512.07389v1", "title": "Gradient estimates and Liouville properties for the drifted Laplacian", "authors": ["Salvatore Lincastri"], "published": "2025-12-08T10:21:45Z", "summary": "In this paper, we discuss the validity of the Liouville property for $X$-harmonic functions, i.e. positive solution to $Δ_{X}u=0$, where $X$ is a vector field on a complete, non-compact Riemannian manifold and $Δ_{X}$ is the drifted Laplacian. In particular, we show that if the $X$-Bakry-Émery-Ricci curvature $\\mathrm{Ric}_{X}$ is non-negative and the norm of $X$ decays to zero at infinity, then the manifold has the Liouville property for the $X$-Laplacian. The proof exploits a local gradient estimate for positive solutions to the semilinear equation $Δ_{X}u+F(u)=0$, which holds when $F$ satisfies the structural conditions $tF'(t)-F(t)\\leα$ and $\\vert F(t)\\vert\\leβt$, and the manifold has $\\mathrm{Ric}_{X}\\ge-(n-1)K$."},
{"id": "http://arxiv.org/abs/2512.07278v1", "title": "Rigidity of the gradient estimate for Einstein manifolds", "authors": ["Sanghoon Lee", "Jiewon Park"], "published": "2025-12-08T08:18:17Z", "summary": "We study the rigidity of Ricci-flat manifolds with quadratic curvature decay under conditions on the Green function. We show that if the gradient of the Green function is uniformly bounded from below, then the manifold is flat. Furthermore, we prove that for a Ricci-flat manifold with quadratic curvature decay and Euclidean volume growth, the curvature is in $L^p$ for any $p \\ge 2$. Combining with Cheeger-Tian \\cite{CT} and Kröncke-Szabó \\cite{KS}, we obtain that the manifold must be ALE of optimal order."},
{"id": "http://arxiv.org/abs/2512.07263v1", "title": "The first nonzero eigenvalue of the weighted p-Laplacian on differential forms", "authors": ["Mingzhu Miao", "Xuerong Qi", "Jiabin Yin"], "published": "2025-12-08T08:01:17Z", "summary": "We introduce the weighted p-Laplace operator acting on differential forms on a metric measure space, which is a natural generalization of the p-Laplace operator defined by Seto [32]. We obtain some sharp lower bounds of the first nonzero eigenvalue for the weighted p-Laplacian. Our results extend an estimate of Seto [32], as well as the eigenvalue estimates derived by Cui-Sun [8] for closed submanifolds."},
{"id": "http://arxiv.org/abs/2512.07257v1", "title": "Mass and volume of four-dimensional Einstein metrics", "authors": ["Matthew Gursky", "Andrea Malchiodi"], "published": "2025-12-08T07:51:06Z", "summary": "Let $(M^4,\\bar{g})$ be an Einstein manifold, where $M^4$ is a smooth, closed, oriented four-manifold $M^4$ and $\\bar{g}$ has positive Einstein constant. Given a point $0 \\in M^4$, let $G$ denote the (positive) Green's function $G$ of the conformal laplacian $L_{\\bar{g}}$; then $g = G^2 \\bar{g}$ is a complete, scalar-flat, asymptotically flat metric on $\\widehat{M} = M \\setminus \\{ 0 \\}$. We first show that the ADM mass of $g$ can be expressed as an integral over $\\widehat{M}$, then use this identity to prove a lower bound for the mass of $g$ in terms of the volume of $\\bar{g}$. As corollaries, we prove a 'mass times volume' inequality, plus various mass gap theorems characterizing the round metric on $S^4$ and the Fubini-Study metric on $\\mathbb{CP}^2$."}
]